# Ejercicios Pair Programming - Modulo 2 - Sprint 2 
## Lecci√≥n 4 - Limpieza IV: Valores Nulos
### Ana Gonzalez y Sonia Ruiz

En este caso trabajaremos con el dataframe que limpiamos en el ejercicio de pair de Limpieza anterior, el de Limpieza III, donde limpiabamos las columnas de species, age, etc. y eliminabamos los outliers.
‚Äã
**Antes de seguir, recordamos las preguntas que nos planteamos al principio del pair programming de EDA para dirigir nuestro an√°lisis.**

- ¬øEs Australia es el sitio m√°s peligroso y letal para estar relajada en la playa?
- ¬øCu√°l es el rango de edad que sufre la mayor√≠a de los ataques?
- Independientemente de la edad, sufren los hombres m√°s ataques que las mujeres?
- ¬øEn qu√© mes ocurren m√°s ataques?
- ¬øCu√°l es la relaci√≥n entre la especie y el tipo de ataque (si es fatal o no)?
- ¬øC√≥mo han evolucionado los ataques a lo largo del tiempo?
De todo esto, nos damos cuenta que solo tenemos que limpiar algunas de las columnas, en concreto age, species, country, fatal, year, sex. Si reducimos esto a una tabla para saber que tenemos ya limpito y que no.

**Actualizamos esta tabla ya que en el ejercicio de pair de Limpieza I ya dejamos algunas columnas limpitas:

| variable | ¬øEst√° limpia?                                                                                 |
|----------|-----------------------------------------------------------------------------------------------|
| age      | ‚úîÔ∏è esta en formato string cuando deber√≠a ser integer y en algunos casos tenemos rangos de edad |
| species  | ‚úîÔ∏è es un jaleo! Debemos unificar los nombres y reducir a las especies m√°s importantes          |
| country  | ‚úîÔ∏è los paises est√°n en may√∫sculas, algunos se repiten con algunos cambios                      |
| fatal    | ‚úîÔ∏è la limpiamos en el pair de Pandas V                                                         |
| year     | ‚úîÔ∏è es una columna de tipo float deber√≠amos convertirla a integer                               |
| sex      | ‚úîÔ∏è la limpiamos en el pair de Pandas V                                                         |
| fecha    | ‚úîÔ∏è la limpiamos en el pair de Pandas V                                                         |

Es el momento de ponernos a trabajar con los valores nulos üí™üèΩ. A lo largo de este ejercicio de pair programming vamos a intentar eliminar los valores nulos de nuestras columnas. En la lecci√≥n hemos aprendido varios m√©todos, nosotras os planteamos los ejercicios pero sentiros libres de usar el m√©todo que m√°s se adapte a vuestras necesidades. Manos a la obra!
1. Lo primero que tenemos que evaluar es en que columnas tenemos nulos y que cantidad tenemos en cada una. ¬øHay alguna columna con una gran cantidad de nulos? En caso de que sea as√≠ deberemos eliminarla.

In [68]:
#Importamos las librerias necesarias para trabajar en este archivo de jupyter.
import pandas as pd
import numpy as np

In [69]:
df=pd.read_csv('files/attacks_limp3.csv',index_col=0)
df.head(3)

   year country age        species_ month dead gender specie  edad
0  2018     usa  57     White shark   Jun    N      F  white  57.0
1  2018  brazil  18     Tiger shark   Jun    Y      M  tiger  18.0
2  2018     usa  15  Bull shark, 6'   May    N      M   bull  15.0

In [70]:
#Obtenemos el porcetanje de nulos que tenemos en cada columna.
df.isnull().sum()*100/df.shape[0]

year         0.000000
country      0.607533
age          7.897934
species_     6.257594
month        9.416768
dead         6.014581
gender       0.911300
specie       6.257594
edad        10.874848
dtype: float64

`Ninguna columna tiene una cantidad de nulos suficiente como para que consideremos eliminarla.`

2. Es el momento de eliminar los nulos:
- Reemplazad los valores nulos de la columna age por la media de la edad, redondeada a dos decimales.

In [71]:
df.head()

   year    country age          species_ month dead gender       specie  edad
0  2018        usa  57       White shark   Jun    N      F        white  57.0
1  2018     brazil  18       Tiger shark   Jun    Y      M        tiger  18.0
2  2018        usa  15    Bull shark, 6'   May    N      M         bull  15.0
3  2018  australia  32   Grey reef shark   May    N      M         grey  32.0
4  2018    england  21  Invalid incident   May    N      M  unspecified  21.0

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1646 entries, 0 to 1671
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   year      1646 non-null   int64
 1   country   1636 non-null   object
 2   age       1516 non-null   object
 3   species_  1543 non-null   object
 4   month     1491 non-null   object
 5   dead      1547 non-null   object
 6   gender    1631 non-null   object
 7   specie    1543 non-null   object
 8   edad      1467 non-null   float64
dtypes: float64(1), int64(1), object(7)
memory usage: 128.6+ KB

In [73]:
#Reemplazamos los valores nulos.
df['edad'].fillna(round(df['edad'].mean(),2), inplace=True)
df['edad'].isnull().sum()

0

In [74]:
#Comprobamos que edad tiene 0% de nulos.
df.isnull().sum()*100/df.shape[0]

year        0.000000
country     0.607533
age         7.897934
species_    6.257594
month       9.416768
dead        6.014581
gender      0.911300
specie      6.257594
edad        0.000000
dtype: float64

- En relaci√≥n a la columna de country al tratarse de una columna de tipo categ√≥rica, reemplazad los valores nulos por una nueva categ√≥ria que se llame Unknown.

In [75]:
df['country'].replace(np.nan,'Unknown',inplace=True)

In [76]:
#Comprobamos que country tiene 0% de nulos.
df.isnull().sum()*100/df.shape[0]

year        0.000000
country     0.000000
age         7.897934
species_    6.257594
month       9.416768
dead        6.014581
gender      0.911300
specie      6.257594
edad        0.000000
dtype: float64

In [77]:
#comprobamos que tenemos la categoria 'Unkwnon' entre los valores unicos de la columna 'country'.
df['country'].unique()

array(['usa', 'brazil', 'australia', 'england', 'costa rica', 'maldives',
       'south africa', 'cuba', 'spain', 'bahamas', 'indonesia', 'egypt',
       'new zealand', 'french polynesia', 'new caledonia', 'ecuador',
       'thailand', 'reunion', 'mexico', 'jamaica', 'italy',
       'papua new guinea', 'russia', 'seychelles', 'vietnam', 'guam',
       'mozambique', 'scotland', 'united kingdom', 'taiwan', 'croatia',
       'fiji', 'tonga', 'st. maartin', 'grand cayman', 'vanuatu',
       'venezuela', 'turks & caicos', 'okinawa', 'marshall islands',
       'mauritius', 'hong kong', 'japan', 'south korea', 'israel',
       'micronesia', 'columbia', 'new britain', 'palau',
       'solomon islands', 'federated states of micronesia', 'greece',
       'british west indies', 'north pacific ocean', 'bermuda',
       'philippines', 'american samoa', 'pacific ocean', 'senegal',
       'argentina', 'el salvador', 'iraq', 'panama', 'india', 'Unknown',
       'barbados', 'martinique', 'guinea', 'greenland', 'france',
       'mediterranean sea', 'sweden', 'iceland', 'roatan',
       'between portugal & india', 'canada', 'kenya', 'uruguay',
       'lebanon', 'sudan', 'djibouti', 'libya', 'sri lanka', 'bahrein',
       'korea', 'iran', 'red sea?', 'singapore', 'madagascar',
       'nicaragua', 'kiribati', 'saudi arabia', 'burma', 'belize',
       'asia?', 'ceylon (sri lanka)'], dtype=object)

- Reemplazad los valores nulos de la columna fatal por Unknown.

In [78]:
df['dead'].replace(np.nan,'Unknown',inplace=True)

In [79]:
#Comprobamos que dead tiene 0% de nulos.
df.isnull().sum()*100/df.shape[0]

year        0.000000
country     0.000000
age         7.897934
species_    6.257594
month       9.416768
dead        0.000000
gender      0.911300
specie      6.257594
edad        0.000000
dtype: float64

In [80]:
#comprobamos que tenemos la categoria 'Unkwnon' entre los valores unicos de la columna 'dead'.
df['dead'].unique()

array(['N', 'Y', 'Unknown'], dtype=object)

- Reemplazad los valores nulos de la columna type por el valor m√°s frecuente (la moda).

In [81]:
df['age'].replace(np.nan,df['age'].mode()[0],inplace=True)

In [82]:
#Comprobamos que age tiene 0% de nulos.
df.isnull().sum()*100/df.shape[0]

year        0.000000
country     0.000000
age         0.000000
species_    6.257594
month       9.416768
dead        0.000000
gender      0.911300
specie      6.257594
edad        0.000000
dtype: float64

- Reemplazad los valores nulos de la columna fecha por Unknown.

In [83]:
df['month'].replace(np.nan,'Unknown',inplace=True)

In [84]:
#Comprobamos que month tiene 0% de nulos.
df.isnull().sum()*100/df.shape[0]

year        0.000000
country     0.000000
age         0.000000
species_    6.257594
month       0.000000
dead        0.000000
gender      0.911300
specie      6.257594
edad        0.000000
dtype: float64

3. Guardad el csv para seguir trabajando con el en los siguientes ejercicios de pair.

In [85]:
df.to_csv('files/attacks_limp4.csv')

**Happy coding** ü¶à